of_vol_inlet/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-4;
boundaryField
{
    inlet   { type turbulentIntensityKineticEnergyInlet; intensity 0.05; value uniform 1e-4; }
    outlet  { type zeroGradient; }
    walls   { type kqRWallFunction; value uniform 1e-4; }
}
