of_vol_inlet/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    inlet   { type turbulentMixingLengthFrequencyInlet; mixingLength 0.01; value uniform 1; }
    outlet  { type zeroGradient; }
    walls   { type omegaWallFunction; value uniform 1; }
}
