of_vol_inlet/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
transportModel  Newtonian;
nu              1.5e-05;   // kinematic viscosity of air [m2/s]
