of_vol_inlet/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType  RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }
