of_vol_inlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Pipe flow: 1m long, 0.1m diameter, for volumetric inlet testing
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0   -0.05 -0.05)   // 0
    (1   -0.05 -0.05)   // 1
    (1    0.05 -0.05)   // 2
    (0    0.05 -0.05)   // 3
    (0   -0.05  0.05)   // 4
    (1   -0.05  0.05)   // 5
    (1    0.05  0.05)   // 6
    (0    0.05  0.05)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 5 5) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);
