of_vol_inlet/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    p       { solver GAMG; smoother GaussSeidel; tolerance 1e-6; relTol 0.1; }
    "(U|k|omega)" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-5; relTol 0.1; }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    residualControl { p 1e-3; U 1e-4; "(k|omega)" 1e-4; }
}

relaxationFactors
{
    equations { U 0.9; k 0.7; omega 0.7; }
}
